<p>Die Auseinandersetzung mit einem nachhaltigen Lebensstil umfasst die Beschäf- tigung mit dem individuellen Konsumverhalten. Im Kontext der Agenda 2030 der Vereinten Nation zur Erreichung der 17 Nachhaltigkeitsziele widmet sich das 12. Ziel mit nachhaltigen Produktions- und Konsummuster. Produktion und Konsum sind eng miteinander verbunden und durch globale Wertschöpfungsketten für einen Großteil des Ressourcenverbrauchs verantwortlich. Für einen nachhaltigen Konsum müssen Informationsasymmetrien zwischen Hersteller und Konsumenten überwunden werden. Die vorliegende Thesis beleuchtet diesen Themenkomplex. Mit der Design Science Research Methode werden die Themen Nachhaltigkeit, nachhaltige Entwicklung und nachhaltiger Konsum sowie der Lebenszyklus von Produkten mit den Bilanzierungs- methoden Ökobilanz und Sozialbilanz analysiert, um die vorhandenen Probleme aufzuzeigen. Ein Lösungsaspekt betrifft die Frage nach geeigneten Visualisierungen, die den komplexen Lebenszyklus mit seinen ökonomischen, ökologischen und sozialen Implikationen für Konsumenten zugänglich macht. Als Ergebnis wird eine Hierarchie des Lebenszyklus in Verbindung der Nachhaltigkeitsdimensionen und den zugrunde- liegenden Ausprägungen vorgestellt. Zu den einzelnen Ebenen werden Designmuster entworfen, die Teilaspekte des allgemeinen Lebenszyklus repräsentieren.</p>
<p>Diese Bachelorarbeit befasst sich mit der Konzeption und Entwicklung eines Layout-Editors und wurde in Zusammenarbeit mit RTL Deutschland verfasst. Diese Applikation soll dem Editieren der Nutzeroberfläche einer bestehenden Webanwendung dienen und in diese integriert werden. Ziel dieser Arbeit ist es auch, sich mit dem Vaadin-Framework auseinanderzusetzen und dessen positiven und negativen Aspekte für die Softwareentwicklung in dem gegebenen Umfeld zu analysieren. In dieser Arbeit werden die aktuellen Standards der Webentwicklung betrachtet und mit Vaadin verglichen. Dabei wird auch die Implementierung einer Drag-and-Drop-Funktionalität behandelt, die dem Anwender eine intuitive Bedienung ermöglichen soll. Zudem sollen Möglichkeiten zur Speicherung der entstehenden Daten und die Integration in das bestehende System betrachtet werden.
Resultat der Arbeit ist ein funktionierender Layout-Editor, mit welchem die Oberfläche der schon bestehenden Webanwendung mittels Drag-and-Drop manipuliert werden kann. Für eine Integration in das bestehende System sind noch Anpassungen nötig. Festgestellt wurde, dass Vaadin sich besonders für Projekte eignet, welche kompakt und relativ unabhängig von anderen agieren. Wenn das Backend für mehr als nur ein Frontend entwickelt werden soll, eignet sich Vaadin eher weniger. In dem Falle wäre eine traditionelle Trennung von Backend und Frontend zu bevorzugen.</p>
<p>Die Masterarbeit befasst sich mit der Konzeption und Entwicklung einer automatisierten Lösung zur Generierung von Beschreibungstexten im E-Commerce Bereich. Die Grundlage hierfür sind strukturierte Produktdaten über Wein. Diese Arbeit zielt darauf ab, die folgenden Fragen zu beantworten: Welches Large Language Modell eignet sich am besten für die Generierung von Beschreibungstexten? Wie lassen sich automatisch generierte Beschreibungstexte bewerten? Und wie muss ein Userinterface gestaltet sein, das eine automatische Generierung ermöglicht?</p>

<p>Für das Beantworten der Forschungsfragen wurden aktuell verfügbare Large Language Modelle verglichen und eine intensive Recherche in der Thematik des Prompt Engineering durchgeführt. Des Weiteren ist ein Plugin für das Shopsystem Shopware konzipiert und implementiert worden, welches es ermöglicht, Beschreibungstexte anhand von strukturierten Produktdaten zu erstellen.</p>

<p>Die Analyse der Modelle hat ergeben, dass sich zum Zeitpunkt dieser Arbeit die Large Language Modelle von OpenAI am besten für die automatische Generierung von Beschreibungstexten eignen. Diese können sich von der Konkurrenz abgrenzen, da sie mit einer geringen Menge an strukturierten Daten konsistente und den Anforderungen entsprechende Ergebnisse liefern. Der Kurzlebigkeit der Modelle geschuldet wird das aktuellste Modell (GPT-4) für die Generierung herangezogen. Das objektive Bewerten von generierten Beschreibungstexten hat sich als herausfordernd herausgestellt. Es hat sich herausgestellt, dass für diesen Anwendungsfall keine allgemeingültigen Bewertungskriterien aufgestellt werden können. Es wurden Ansätze geschaffen, die eine Grundlage für zukünftige Untersuchungen ermöglichen.</p>

[


{
  "title": " Design und Konzeption von interaktiven Visualisierungen des Produktlebenszyklus zur Vermittlung von Nachhaltigkeit",
}
,

{
  "title": "Konzeption und Entwicklung einer Vaadin-Applikation zur Modifikation des Layouts eines Webklienten im Kontext der Mediengesellschaft RTL",
}
,

{
  "title": "Konzeption und Entwicklung einer automatisierten Lösung zur Generierung von Beschreibungstexten für Wein im E-Commerce Bereich auf Basis strukturierter Produktdaten",
}


]
